SELECT
    city,
    COUNT(*) as total,
    ROUND((COUNT(CASE WHEN gender = 'man'   THEN 1 END) * 100.0) / COUNT(*), 2) as men,
    ROUND((COUNT(CASE WHEN gender = 'woman' THEN 1 END) * 100.0) / COUNT(*), 2) as women
FROM planet.t_basic_etl2
WHERE gender IN ('man', 'woman')
GROUP BY city
HAVING total > 100
ORDER BY women DESC
;

city    total   men women
Краснодар      1358 50.44   49.56
Орёл            144 51.39   48.61
Кемерово        266 53.76   46.24
Архангельск     181 55.25   44.75
Иркутск         499 55.31   44.69
Красноярск      818 55.62   44.38
Тюмень          538 56.88   43.12
Астрахань       226 57.08   42.92
Барнаул         436 57.11   42.89
Владимир        221 57.47   42.53
Калининград     551 57.71   42.29
Челябинск       915 57.92   42.08
Самара          823 58.08   41.92
Ростов-на-Дону  995 58.09   41.91
Улан-Удэ        163 58.28   41.72
Симферополь     228 58.33   41.67
Иваново         186 58.60   41.40
Воронеж         689 58.64   41.36
Таганрог        119 58.82   41.18
Петрозаводск    146 58.90   41.10
Анапа           144 59.03   40.97
Санкт-Петербург 5062 59.07   40.93
Оренбург         309 59.22   40.78
Новосибирск     1300 59.23   40.77
Ижевск          314 59.24   40.76
Сочи            386 59.84   40.16
Томск           334 59.88   40.12
Белгород        282 59.93   40.07
Тамбов          135 60.00   40.00
Омск            587 60.14   39.86
Благовещенск (Амурская обл.)    151 60.26   39.74
Волгоград       448 60.49   39.51
Южно-Сахалинск  132 60.61   39.39
Севастополь     210 60.95   39.05
Горад Мінск     630 61.11   38.89
Алматы          152 61.18   38.82
Пенза           263 61.22   38.78
Тула            338 61.24   38.76
Пермь           636 61.32   38.68
Уфа             733 61.39   38.61
Сыктывкар       101 61.39   38.61
Вологда         140 61.43   38.57
Владивосток     499 61.52   38.48
Курган          123 61.79   38.21
Саратов         542 61.81   38.19
Новокузнецк     199 61.81   38.19
Ставрополь      302 61.92   38.08
Мурманск        192 61.98   38.02
Липецк          264 62.12   37.88
Нижний Тагил    127 62.20   37.80
Одинцово        122 62.30   37.70
Казань          788 62.44   37.56
Тверь           308 62.66   37.34
Екатеринбург    1358    62.89   37.11
Москва          13804   63.03   36.97
Великий Новгород    147 63.27   36.73
Кострома    112 63.39   36.61
Нижний Новгород 956 63.49   36.51
Калуга  168 63.69   36.31
Ярославль   449 63.70   36.30
Ульяновск   344 63.95   36.05
Тольятти    303 64.03   35.97
Смоленск    179 64.25   35.75
Новороссийск    182 64.29   35.71
Рязань  285 64.56   35.44
Чебоксары   153 64.71   35.29
Брянск  234 64.96   35.04
Донецк  155 65.16   34.84
Подольск    181 65.19   34.81
Киев    103 66.02   33.98
Псков   124 66.13   33.87
Нижневартовск   101 66.34   33.66
Магнитогорск    140 66.43   33.57
Хабаровск   375 66.67   33.33
Сургут  207 67.63   32.37
Киров (Кировская обл.)  198 67.68   32.32
Йошкар-Ола  115 67.83   32.17
Балашиха    106 67.92   32.08
Набережные Челны    249 68.27   31.73
Бийск   104 68.27   31.73
Washington D.C. 145 68.28   31.72
Люберцы 131 68.70   31.30
Чита    159 69.18   30.82
Саранск 114 69.30   30.70
Курск   234 70.94   29.06
Зеленоград  149 71.14   28.86
Череповец   108 71.30   28.70
Петропавловск-Камчатский    113 72.57   27.43
Якутск  105 76.19   23.81
Махачкала   110 76.36   23.64
Бишкек  153 78.43   21.57
القاهرة 105 83.81   16.19
Toshkent    398 88.19   11.81
Երեվան  112 89.29   10.71








SELECT 
    city,
    COUNT(*) as total,
    ROUND((COUNT(CASE WHEN gender = 'man'     THEN 1 END) * 100.0) / COUNT(*), 2) as men,
    ROUND((COUNT(CASE WHEN gender = 'woman'   THEN 1 END) * 100.0) / COUNT(*), 2) as women,
    ROUND((COUNT(CASE WHEN gender = 'unknown' THEN 1 END) * 100.0) / COUNT(*), 2) as unknown
FROM planet.t_basic_etl
GROUP BY city
ORDER BY total DESC
;

city             total   men   women   unknown
Москва            14087 60.52   35.56   3.93
Санкт-Петербург    5112 57.24   39.96   2.80
Екатеринбург       1360 61.18   35.96   2.87
Новосибирск        1287 58.04   39.70   2.25
Нижний Новгород     949 61.54   35.93   2.53
Пермь               625 60.48   37.60   1.92
Великий Новгород    142 61.97   35.21   2.82
Псков               124 65.32   33.87   0.81
